app/views/projects/show.html.erb

  <tbody>
    <% @project.tasks.each do |task| %>
---
SELECT  "tasks".* FROM "tasks"  WHERE "tasks"."project_id" = ?  ORDER BY project_order DESC LIMIT 1  [["project_id", 1]]