app/controllers/projects_controller.rb

INSERT INTO "projects" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", "2016-05-29 16:44:42.957847"], ["name", "Brush my teeth"], ["updated_at", "2016-05-29 16:44:42.957847"]]
---
  def create
    @action = CreatesProject.new(
      name: params[:project][:name], task_string: params[:project][:tasks])
    success = @action.create