app/controllers/tasks_controller.rb

SELECT  "projects".* FROM "projects"  WHERE "projects"."id" = ? LIMIT 1  [["id", 0]]
SELECT  "tasks".* FROM "tasks"  WHERE "tasks"."project_id" = ?  ORDER BY project_order DESC LIMIT 1  [["project_id", 1]]
INSERT INTO "tasks" ("created_at", "project_id", "project_order", "size", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", "2016-05-31 19:59:47.297381"], ["project_id", 1], ["project_order", 2], ["size", 1], ["title", "New Task"], ["updated_at", "2016-05-31 19:59:47.297381"]]
---
	def create
    @project = Project.find(params[:task][:project_id])
    @project.tasks.create(title: params[:task][:title],
                          size: params[:task][:size],
                          project_order: @project.next_task_order)

SELECT  "tasks".* FROM "tasks"  WHERE "tasks"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "tasks" SET "completed_at" = ?, "size" = ?, "updated_at" = ? WHERE "tasks"."id" = 1  [["completed_at", "2016-05-29 18:57:53.370277"], ["size", 3], ["updated_at", "2016-05-29 18:57:53.370768"]]
---
	def update
		@task = Task.find(params[:id])
		completed = params[:task].delete(:completed)
		params[:task][:completed_at] = Time.current if completed
		if @task.update_attributes(params[:task].permit(:size, :completed_at))

SELECT  "tasks".* FROM "tasks"  WHERE "tasks"."id" = ? LIMIT 1  [["id", 6]]
---
  def up
    @task = Task.find(params[:id])

SELECT  "tasks".* FROM "tasks"  WHERE "tasks"."id" = ? LIMIT 1  [["id", 6]]
---
  def down
    @task = Task.find(params[:id])